# IsValidSegmentId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..IsValidSegmentId Method
CompoundStructure Class See Also
---
Determines whether the specified integer is actually the id of a segment in this CompoundStructure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsValidSegmentId(
	int segmentId
)
```

Visual Basic
---
```text
Public Function IsValidSegmentId ( _
	segmentId As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidSegmentId(
	int segmentId
)
```

# ### Parameters
segmentId
    Type: System..::..Int32 The id of a segment in this CompoundStructure.
# ### Return Value
True if the specified segment is valid, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This operation is valid only for vertically compound structures. |

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace